# String

In [2]:
import numpy as np
import pandas as pd

18. Write a Pandas program to:

convert all the string values to upper, lower cases in a given pandas series. 

Also find the length of the string values.

* Sample : 
```python
['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog']
```

In [3]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])
print(s.str.upper())
s.str.len()

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

19. Write a Pandas program to remove whitespaces, left sided whitespaces
and right sided whitespaces of the string values of a given pandas series.
* Sample :
```python
[' Green', 'Black ', ' Red ', 'White', ' Pink ']
```

In [4]:
s =  [' Green', 'Black ', ' Red ', 'White', ' Pink ']
s = pd.Series(s).str.strip()
s

0    Green
1    Black
2      Red
3    White
4     Pink
dtype: object

20. Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

* Sample :
```pthon
'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997
'],
'age': [18.5, 21.2, 22.5, 22, 23]
```
* Substring : `‘2’`
* Column: `‘name_code’`

In [46]:
 df = pd.DataFrame({
     "name_code":['c001','c002','c022', 'c2002', 'c2222'],
     "date_of_birth":['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
     "age": [18.5, 21.2, 22.5, 22, 23]})
    
#Substring : ‘2’ Column: ‘name_code’

df['count'] = df['name_code'].str.count('2')
#df['count'] = df['name_code'].map(lambda x : x.count('2'))
df

  name_code date_of_birth   age  count
0      c001    12/05/2002  18.5      0
1      c002    16/02/1999  21.2      1
2      c022    25/09/1998  22.5      2
3     c2002    12/02/2022  22.0      2
4     c2222    15/09/1997  23.0      4

21. Write a Pandas program to check if a specified column starts with a specified string in a DataFrame.

* Sample :
```python
'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
'date_of_sale':
['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
```
* Test start string : 
```python
‘ze’ - column : ‘company_code’
```

In [5]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

df[df['company_code'].str.startswith('ze')]

  company_code date_of_sale  sale_amount
2      zefsalf   25/09/1998         22.5
4      zekfsdf   15/09/1997         23.0

22. Write a Pandas program to replace arbitrary values with other values in a
given DataFrame.

* Sample :
```python
'company_code': ['A','B', 'C', 'D', 'A'],
'date_of_sale':
['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
```
* Replace value ```‘A’``` to ```‘C’``` - ```Column : ‘company_code’```

In [6]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

df['company_code'].str.replace('A','C')

0       Cbcd
1       EFGF
2    zefsalf
3    sdfslew
4    zekfsdf
Name: company_code, dtype: object

In [8]:
# example of map use with lambda
s= pd.Series(map(lambda x: x**2, s.index))
s

0     0
1     1
2     4
3     9
4    16
dtype: int64